Tekla Open API Reference for Tekla Structures 2025
Loop.GetVertexEnumerator Method
 Gets a new vertex enumerator.
 Namespace: Tekla.Structures.Solid
 Assembly: Tekla.Structures (in Tekla.Structures.dll) Version: 2025.0.0-alpha00048669+a99462f17964bc42624ada6e8d316db2d795d226
Syntax
public VertexEnumerator GetVertexEnumerator()
Public Function GetVertexEnumerator As VertexEnumerator
Return Value
Type: VertexEnumerator
A vertex enumerator to enumerate through the vertexes in the loop.
See Also
Reference
Loop Class
Tekla.Structures.Solid Namespace